using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ex13
{
    class Program
    {
        static void Main(string[] args)
        {
            //Сергеев Александр
            //а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
            //б) *Сделать задание, только вывод организовать в центре экрана.
            //в) **Сделать задание б с использованием собственных методов(например, Print(string ms, int x, int y).



            //а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.

            //Console.WriteLine("Привет!");
            //Console.WriteLine("Как вас зовут?");
            //string name = Console.ReadLine();
            //Console.WriteLine(name + " приятно познакомиться, назовите вашу фамилию?");
            //string lastname = Console.ReadLine();
            //Console.WriteLine("От куда ты?");
            //string city = Console.ReadLine();
            //string result = $"Ваше имя {name} , фамилия {lastname} , город {city}";
            //Console.WriteLine(result);
            //Console.ReadKey();



            //б) *Сделать задание, только вывод организовать в центре экрана.

            //Console.WriteLine("Привет!");
            //Console.WriteLine("Как вас зовут?");
            //string name = Console.ReadLine();
            //Console.WriteLine(name + " приятно познакомиться, назовите вашу фамилию?");
            //string lastname = Console.ReadLine();
            //Console.WriteLine("От куда ты?");
            //string city = Console.ReadLine();
            //Console.SetCursorPosition(48, 15);
            //string result = $"Ваше имя {name} , фамилия {lastname} , город {city}";
            //Console.WriteLine(result);
            //Console.ReadKey();
        }
    }
}
